COMPUTERS-WEBSİTE/app/Models/Panelmodel.php

    public function veri_ekle($baslik, $url, $icerik, $resim)
    {
        $builder = $this->db->table('computers');
        $data = [
            'baslik' => $baslik,
            'url' => $url,
            'resim' => $resim,
            'icerik' => $icerik,
        ];
        return $builder->insert($data);
---
INSERT INTO `computers` (`baslik`, `url`, `resim`, `icerik`) VALUES ('ads', 'ads', '1704932037_bb8fb8729fbd05508126.jpg', 'sad')